CSI API ETABS v1

# cDesignConcreteEurocode_2_2004 Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDCoEurocode_2_2004 Eurocode_2_2004 { get; }

    ReadOnly Property Eurocode_2_2004 As cDCoEurocode_2_2004
    	Get

    Dim instance As cDesignConcrete
    Dim value As cDCoEurocode_2_2004

    value = instance.Eurocode_2_2004

    property cDCoEurocode_2_2004^ Eurocode_2_2004 {
    	cDCoEurocode_2_2004^ get ();
    }

    abstract Eurocode_2_2004 : cDCoEurocode_2_2004 with get

#### Property Value

Type: cDCoEurocode_2_2004

See Also

#### Reference

cDesignConcrete Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com